app/views/books/index.html.erb

SELECT "people".* FROM "people" INNER JOIN "books_people" ON "people"."id" = "books_people"."person_id" WHERE "books_people"."book_id" = ?  [["book_id", 1]]
---
            <td>
              <% book.people.each do |p| %>