app/controllers/books_controller.rb

  def index
    @books = Book.all.page(
      params[:page]
      ).per(10)
---
SELECT  "books".* FROM "books" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"

  def new
    @book = Book.new
    @events = Event.all
---
SELECT "events".* FROM "events"

  def edit
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create

    @events = Event.all
    @people = Person.all
    @book = Book.new(book_params)
    # print (">>>>>>>>>>########  #{@book.event} ######## #{@book.event_id} ######## #{@book.titulo}")
    respond_to do |format|
      if @book.save
---
SELECT "events".* FROM "events"
INSERT INTO "books" ("titulo", "resumo", "paginas", "tipo", "idioma", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "tipo" = ?, "idioma" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["tipo", "Artigo Completo"], ["idioma", "Português"], ["updated_at", "2018-07-17 14:11:22.007612"], ["id", 1]]