app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("nome", "data", "local", "qualis", "site", "issn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)