app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("titulo", "descricao", "edital", "datainicio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)